## 📋 OpenTofu Plan

**Environment:** `dev`
**Directory:** `./environments/dev`

<details>
<summary>Show Plan Output</summary>

```hcl
data.azurerm_management_group.tenant_root: Reading...
data.azurerm_management_group.tenant_root: Read complete after 0s [id=/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.drive_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "drive"
      + id                         = (known after apply)
      + name                       = "mg-drive-prd-glb-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.sandbox_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "sandbox"
      + id                         = (known after apply)
      + name                       = "mg-sandbox-dev-glb-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + drive_management_group          = {
      + display_name = "drive"
      + id           = (known after apply)
      + name         = "mg-drive-prd-glb-01"
    }
  + environment_info                = {
      + environment = "dev"
      + tenant_id   = "90d27970-b92c-43dc-9935-1ed557d8e20e"
    }
  + sandbox_management_group        = {
      + display_name = "sandbox"
      + id           = (known after apply)
      + name         = "mg-sandbox-dev-glb-01"
    }
  + tenant_root_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Triggered by @KrijnvanderBurg in commit 3797935e044671d69881f1fda58eb6c83d93014b*